/************************************************************************************
//（店名“众明工作室”）淘宝链接: https://shop149406681.taobao.com/?spm=a1z10.1-c.0.0.64cb457fKzgKea 
//淘宝店内搜索关键词：K_A38_001
//  版 本 号   : v1.0
//  作    者   : 众明工作室
//  交流群 :			 1041406448（其它更多资料请关注公告）
//    CSDN  （基本参数，资源更新列表，所有接线说明）   :单片机代码搬运工(搜索关键词：K_A38_001)
//    BILIBILI（演示视频） :众明工作室(搜索关键词：K_A38_001)
//  生成日期   : 2021-6-21
//  最近修改   : 2021-11-21
//  功能描述   : DS1302块测试程序
//  测试条件   : STM32F103C8T6   晶振8M  系统时钟72M
接线
DS1302---------------------------------STM32F103C8T6
VCC------------------------------------5V
GND------------------------------------GND
CLK------------------------------------PA_2 //
DAT------------------------------------PA_0 //	
RST------------------------------------PA_1 //	

OLED0.96
VCC------------------------------------3.3V
GND------------------------------------GND
SCL------------------------------------PB_8 //SCL
SDA------------------------------------PB_9 //SDA	
*************************************************************************************/


#include "oled.h"
#include "delay.h"
#include "DS1302.h"
#include "bsp_usart.h"

uint8_t D_Buf[11]={0};  //存储年月日
uint8_t Time_Buf[10]={0}; //存储时分秒
uint8_t year=20;           //年高两位
uint8_t week[2]={0};               //星期
uint8_t KEY0_Num=0;           //切换调整项


void DS1302_Dis()
{
 
		Ds1302ReadTime();
		Time_Buf[7]=TIME[0]%16+0x30;
		Time_Buf[6]=TIME[0]/16+0x30;
		Time_Buf[5]=':';
		/**分显示**/
		Time_Buf[4]=TIME[1]%16+0x30;
		Time_Buf[3]=TIME[1]/16+0x30;

		Time_Buf[2]=':';
		/**时显示**/
		Time_Buf[1]=TIME[2]%16+0x30;
		Time_Buf[0]=TIME[2]/16+0x30;
		Time_Buf[8]='\0';//结束符号
	
	
		/**日显示**/
		D_Buf[9]=TIME[3]%16+0x30;
		D_Buf[8]=TIME[3]/16+0x30;   
		D_Buf[7]='-';    
		/**月显示**/
		D_Buf[6]=TIME[4]%16+0x30;
		D_Buf[5]=TIME[4]/16+0x30;   
		D_Buf[4]='-';    
		/**年低两位显示**/
		D_Buf[3]=TIME[6]%16+0x30;
		D_Buf[2]=TIME[6]/16+0x30;   
		/**年低高位显示**/
		D_Buf[1]=year%10+0x30;
		D_Buf[0]=year/10+0x30;   

		D_Buf[10]='\0';//结束符号
		
		/**周显示**/
//		week[0]=TIME[5]+0x30;
		week[0]=TIME[5];
		week[1] = '\0';
		OLED_ShowString(20,0,D_Buf,16);
		OLED_P16x16Ch(40,2,8);
		OLED_P16x16Ch(56,2,9);
		OLED_P16x16Ch(72,2,week[0]);
		OLED_ShowString(30, 4,Time_Buf,16);
		
		
}



int main(void)
{
	
		DelayInit();
		OLED_Init();
		OLED_Clear();
		USART_Config();
		Ds1302Init();
		while(1)
		{

			DS1302_Dis();
			DelayMs(300);
		}
}
