/************************************************************************************
//（店名“众明工作室”）淘宝链接: https://shop149406681.taobao.com/?spm=a1z10.1-c.0.0.64cb457fKzgKea 
//淘宝店内搜索关键词：K_A08_002 
//  版 本 号   : v1.0
//  作    者   : 众明工作室
//  交流群 :			 1041406448（其它更多资料请关注公告）
//    CSDN  （基本参数，资源更新列表，所有接线说明）   :单片机代码搬运工(搜索关键词：K_A08_002)
//    BILIBILI（演示视频） :众明工作室(搜索关键词：K_A08_002)
//  生成日期   : 2021-6-21
//  最近修改   : 2021-11-21
//  功能描述   : MAX1508电机驱动器测试程序 
//  测试条件   : STC9C52RC   晶振11.0592M  
接线
VCC---------------------------------------------8V（此处用8V 实际看要求）
MAX1508电机驱动器---------------------------------STC9C52RC

GND---------------------------------------------GND(与单片机共地)
IN_1--------------------------------------------P1^0
IN_2--------------------------------------------P1^1
IN_3--------------------------------------------P1^2
IN_4--------------------------------------------P1^3


按键--------------------------------------------STC9C52RC
K_Start_Stop       -----------------------------P2^0  //启停按键 标号2							
K_Syntropy_Reverse -----------------------------P2^1			//两电机同向反向按键	标号1	
K_UP_Speed     	   -----------------------------P2^2		//两电机同时加速按键		标号3	
K_Down_Speed       -----------------------------P2^3			//两电机同时减速按键  标号4
*******************************************************/

#include "DHT11.h"
#include "OLED.h"
uint8_t Duty=5;	   //初始为15角度90
uint8_t Period=180;	//周期20ms
uint8_t times=0;		//计数	  

//定时器0初始化
void time0init(void)
{
		TMOD=0X01;
		TL0 = 0xA4;		//设置定时初值
		TH0 = 0xFF;		//设置定时初值 0.1ms
		TR0=1;
		ET0=1;
		EA=1;
}

void tim0() interrupt 1
{
	TL0 = 0xA4;		//设置定时初值
	TH0 = 0xFF;		//设置定时初值  0.1ms

	times++;
	if(times<=Duty)
	{
	   Pwm=1;
	}
	else
	{
	   Pwm=0;
	} 
	if(times>=Period)
	{
	   times=0;
	}
}


